import React from 'react';

function Chat() {

  const chatList = [
    {  id:1, title:'메세지함 테스트 데이터 1', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 25일 10시 30분', read:1},
    {  id:2, title:'메세지함 테스트 데이터 2', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 10시 30분', read:1},
    {  id:3, title:'메세지함 테스트 데이터 3', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 13시 30분', read:1},
    {  id:4, title:'메세지함 테스트 데이터 4', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:1},
    {  id:5, title:'메세지함 테스트 데이터 5', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:1},
    {  id:6, title:'메세지함 테스트 데이터 6', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:1},
    {  id:7, title:'메세지함 테스트 데이터 7', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:1},
    {  id:8, title:'메세지함 테스트 데이터 8', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:0},
    {  id:9, title:'메세지함 테스트 데이터 9', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:0},
    {  id:10, title:'메세지함 테스트 데이터 10', content:'좋아요를 눌렀던 @@@@ 상품의 라이브가 @@일 @@시 @@분에 시작될 예정입니다.', time:'2022년 7월 26일 16시 30분', read:0},
]
  return (
    <div>
      채팅방 목록
    </div>
  );
}

export default Chat;